In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("data.csv")

In [3]:
df1=pd.DataFrame([[1,2,3,4],[3,4,5,6],[6,7,8,9],[3,4,56,7,]],columns=['A','B','C','D'])

In [4]:
df1.head()

   A  B   C  D
0  1  2   3  4
1  3  4   5  6
2  6  7   8  9
3  3  4  56  7

In [5]:
df1.to_csv('export.csv')

In [6]:
df = pd.DataFrame({'name': ['Raphael', 'Donatello'],
                   'mask': ['red', 'purple'],
                   'weapon': ['sai', 'bo staff']})

In [7]:
df

        name    mask    weapon
0    Raphael     red       sai
1  Donatello  purple  bo staff

In [10]:
df.iloc[0,0]="amar"

In [11]:
df

        name    mask    weapon
0       amar     red       sai
1  Donatello  purple  bo staff

# Merging DataFrames

In [12]:
df=pd.DataFrame([[1,2,3,4],[3,4,5,6],[6,7,8,9],[3,4,56,7,]],columns=['A','B','C','D'])

In [13]:
df1=pd.DataFrame([[1,2,3,2],[43,4,15,6],[6,75,8,95],[1,5,65,7,]],columns=['P','Q','R','S'])

In [28]:
df3=pd.merge(df,df1,right_on="Q",left_on="B")

In [29]:
df3

   A  B   C  D   P  Q   R  S
0  1  2   3  4   1  2   3  2
1  3  4   5  6  43  4  15  6
2  3  4  56  7  43  4  15  6